import json

data = {
    "Имя": "Анна",
    "Фамилия": "Борисенко",
    "Отчество": "Евгеньевна",
    "Адрес": {
        "Улица": "Princess st., 1, f. 1",
        "Город": "Princess Tower",
        "Индекс": 123456
    },
    "Контанктные данные": {
        "Страница vk.com":"vk.com/borrisca_ancka",
        "Страница instagram":"@basechkaa",
        "Номер телефона":"-",
    },
    "Примечания":"студент группы ВПИ11, староста группы"
},{
    "Имя": "Данил",
    "Фамилия": "Рябухин",
    "Отчество": "Романович",
    "Адрес": {
        "Улица": "Мечникова 79/а",
        "Город": "Ростов-на-Дону",
        "Индекс": 344000
    },
    "Контанктные данные": {
        "Страница vk.com":"vk.com/danil0177",
        "Страница instagram":"@takesheez",
        "Номер телефона":"-",
    },
    "Примечания":"студент группы ВПИ11, обычный смертный"

},{
    "Имя": "Максим",
    "Фамилия": "Мороз",
    "Отчество": "-",
    "Адрес": {
        "Улица": "Мечникова 79/а",
        "Город": "Ростов-на-Дону",
        "Индекс": 344000
    },
    "Контанктные данные": {
        "Страница vk.com":"vk.com/defgabc",
        "Страница instagram":"-",
        "Номер телефона":"-",
    },
    "Примечания":"студент группы ВПИ11, приехал из Москвы"
},{
    "Имя": "Никита",
    "Фамилия": "Королев",
    "Отчество": "-",
    "Адрес": {
        "Улица": "Мечникова 79/а",
        "Город": "Ростов-на-Дону",
        "Индекс": 344000
    },
    "Контанктные данные": {
        "Страница vk.com":"vk.com/idntfc",
        "Страница instagram":"@rolls.noroyce",
        "Номер телефона":"-",
    },
    "Примечания":"студент группы ВПИ11, остался на стипендии"
},{
    "Имя": "Алексей",
    "Фамилия": "Кононенко",
    "Отчество": "-",
    "Адрес": {
        "Улица": "Мечникова 79/а",
        "Город": "Ростов-на-Дону",
        "Индекс": 344000
    },
    "Контанктные данные": {
        "Страница vk.com":"vk.com/id183642948",
        "Страница instagram":"-",
        "Номер телефона":"-",
    },
    "Примечания":"студент группы ВПИ11, обычный смертный"
},{
    "Имя": "Сергей",
    "Фамилия": "Карпак",
    "Отчество": "-",
    "Адрес": {
        "Улица": "Мечникова 79/а",
        "Город": "Ростов-на-Дону",
        "Индекс": 344000
    },
    "Контанктные данные": {
        "Страница vk.com":"vk.com/karpaksergey",
        "Страница instagram":"-",
        "Номер телефона":"-",
    },
    "Примечания":"студент группы ВПИ11, обычный смертный"
},{
    "Имя": "Иван",
    "Фамилия": "Гетманченко",
    "Отчество": "-",
    "Адрес": {
        "Улица": "-",
        "Город": "Ростов-на-Дону",
        "Индекс": 344000
    },
    "Контанктные данные": {
        "Страница vk.com":"vk.com/ex_friend1",
        "Страница instagram":"-",
        "Номер телефона":"-",
    },
    "Примечания":"студент группы ВПИ11, обычный смертный"
},{
    "Имя": "Денис",
    "Фамилия": "Еретин",
    "Отчество": "-",
    "Адрес": {
        "Улица": "-",
        "Город": "Ростов-на-Дону",
        "Индекс": 344000
    },
    "Контанктные данные": {
        "Страница vk.com":"vk.com/smert_bidron",
        "Страница instagram":"-",
        "Номер телефона":"-",
    },
    "Примечания":"студент группы ВПИ11, профорг"
},{
    "Имя": "Артем",
    "Фамилия": "Вергун",
    "Отчество": "-",
    "Адрес": {
        "Улица": "-",
        "Город": "Ростов-на-Дону",
        "Индекс": 344000
    },
    "Контанктные данные": {
        "Страница vk.com":"vk.com/morouz",
        "Страница instagram":"-",
        "Номер телефона":"-",
    },
    "Примечания":"студент группы ВПИ11, админ паблика с мемами во вконтакте"
},{
    "Имя": "Ксения",
    "Фамилия": "Лапкова",
    "Отчество": "-",
    "Адрес": {
        "Улица": "-",
        "Город": "Ростов-на-Дону",
        "Индекс": 344000
    },
    "Контанктные данные": {
        "Страница vk.com":"vk.com/id140164457",
        "Страница instagram":"black0butler0",
        "Номер телефона":"-",
    },
    "Примечания":"студент группы ВПИ11, рыжая"
}
with open('result.json', 'w') as outfile: json.dump(data,outfile)